'''
Дан произвольный список. Вывести на экран в обратном порядке. 
Задачу решить 2мя способами. 
'''

numbers = [1, 2, 3, 4, 5]

print(numbers[::-1])


numbers_2 = [1, 2, 3, 4, 5]

print(list(reversed(numbers_2)))