'''
Дан список
['samsung', 'lg', 'xerox', 'bosch']
Удалить элемент с именем 'xerox'
Добавить элемент на 2 место 'indesit'

'''

holod = ['samsung', 'lg', 'xerox', 'bosch']
holod.remove('xerox')
holod.insert(1, 'indesit')
print(holod)