'''

**

Есть список чисел: 
some_list = [111, 222, 333, 444, 555, 666, 777, 888, 999]. 

* Нужно преобразовать его в одну строку, где элементы списка 
    разделены '---'
    Результат:  
    111---222---333---444---555---666---777---888---999

** дополнительно каждый элемент списка разделить дефисом 
    образец: 111 -> 1-1-1 

    Результат:  
    1-1-1---2-2-2---3-3-3---4-4-4---5-5-5---6-6-6---7-7-7---8-8-8---9-9-9


не использовать for и lambda

'''

some_list = [111, 222, 333, 444, 555, 666, 777, 888, 999]

def dash_digits(x):          # функция для превращения 111 → 1-1-1
    return "-".join(str(x))  # str(x) → "111"; "-".join("111") → "1-1-1"

result = "---".join(map(dash_digits, some_list))

print(result)